config.org
# -*- eval: (remove-hook 'before-save-hook 'org-encrypt-entries t); eval: (auto-save-mode 0); -*-
#+TITLE: Configuration
#+AUTHOR: Richard Sent
#+PROPERTY: header-args :results silent :mkdirp yes

This is a comprehensive configuration file for my system.

I still need to implement package installing using GNU Guix. ~wob~ and
~pywal~ are two that I am looking at. I also want to migrate more
packages to use Guix to improve migratability of my configuration to
new machines.

* Warning!

When using noweb, be /very/ careful to be consistent with function
names. If I make a mistake (i.e. using ~src/~ for the name and ~src-~
in the call), ~my/tangle-init~ will fail silently for the rest of the session.

* Base

I also have a =daemon.sh= file that creates any necessary background
daemons.

#+begin_src shell :tangle ~/daemon.sh :shebang #!/usr/bin/env bash
#+end_src

** Logging

=setup.sh= and any daemons I create should log to this file. Note that
this returns ~" "~ around  the object if you use noweb. As such, I use
~${HOME}/~ instead of ~~/~ as =bash= will complain otherwise if you
try to use it during redirection.

#+NAME: src/config-log-file
#+begin_src emacs-lisp :tangle no
  "${HOME}/.log.txt"
#+end_src

* Bash

** .bashrc

An incomplete =.bashrc= file. I plan on breaking it up across the
config file.

I also need to fix ssh-agent environment variables. They aren't passed
to Emacs or other subprocesses when launched through dmenu.

#+begin_src shell :tangle ~/.bashrc
  # /etc/skel/.bashrc
  #
  # This file is sourced by all *interactive* bash shells on startup,
  # including some apparently interactive shells such as scp and rcp
  # that can't tolerate any output.  So make sure this doesn't display
  # anything or bad things will happen !

  export PATH=~/bin:$PATH

  # Test for an interactive shell.  There is no need to set anything
  # past this point for scp and rcp, and it's important to refrain from
  # outputting anything in those cases.
  if [[ $- != *i* ]] ; then
      # Shell is non-interactive.  Be done now!
      return
  fi

  # Put your fun stuff here.
  alias dotfiles='/usr/bin/git --git-dir=$HOME/.dotfiles/ --work-tree=$HOME'

  # Color output from less
  export LESS_TERMCAP_mb=$'\e[1;32m'
  export LESS_TERMCAP_md=$'\e[1;32m'
  export LESS_TERMCAP_me=$'\e[0m'
  export LESS_TERMCAP_se=$'\e[0m'
  export LESS_TERMCAP_so=$'\e[01;33m'
  export LESS_TERMCAP_ue=$'\e[0m'
  export LESS_TERMCAP_us=$'\e[1;4;31m'

  # Rbenv setup, trying new method to only run if rbenv is installed
  # "$(rbenv init -)"
  if type rbenv >/dev/null 2>&1
  then
      $(rbenv init -)
  fi

  # Use ssh-agent to temporarily store passphrases in RAM
  if ! pgrep -u "$USER" ssh-agent > /dev/null; then
      ssh-agent -t 1h > "$XDG_RUNTIME_DIR/ssh-agent.env"
  fi
  if [[ ! "$SSH_AUTH_SOCK" ]]; then
      source "$XDG_RUNTIME_DIR/ssh-agent.env" >/dev/null
  fi

  # Colored diffs and colored cats (meow)
  alias cdiff=colordiff
  alias ccat=bat

  export EDITOR=$'jove'
#+end_src

** .bash_profile

#+begin_src bash :tangle ~/.bash_profile
  # /etc/skel/.bash_profile

  # This file is sourced by bash for login shells.  The following line
  # runs your .bashrc and is recommended by the bash info pages.
  if [[ -f ~/.bashrc ]] ; then
      . ~/.bashrc
  fi

  # See https://askubuntu.com/a/121075 for what should go
  # in .bashrc, .bash_profile, and .profile
  [[ -r ~/.profile ]] && . ~/.profile

  # Use ssh-agent to temporarily store passphrases in RAM
  if ! pgrep -u "$USER" ssh-agent > /dev/null; then
      ssh-agent -t 1h > "$XDG_RUNTIME_DIR/ssh-agent.env"
  fi
  if [[ ! "$SSH_AUTH_SOCK" ]]; then
      source "$XDG_RUNTIME_DIR/ssh-agent.env" >/dev/null
  fi
#+end_src

** .profile

#+begin_src bash :tangle ~/.profile
  # Enable Wayland support for Firefox
  export MOZ_ENABLE_WAYLAND=1
#+end_src

* Fish
:PROPERTIES:
:header-args: :tangle ~/.config/fish/config.fish
:END:

** Interactive

*** Preamble

#+begin_src shell
  if status is-interactive
#+end_src

*** Body

**** Dotfiles Alias

#+begin_src shell
  alias dotfiles='/usr/bin/git --git-dir=$HOME/.dotfiles/ --work-tree=$HOME'
#+end_src

***** TODO Eliminate redundancy between bashrc and this

*** Postamble

#+begin_src shell
  end
#+end_src

* Fontconfig

I can use tools like ~fc-list~ to view what fonts I have installed and
available. Similarly, ~fc-match~ will tell me what names are valid for
those fonts..

#+begin_src xml :tangle ~/.config/fontconfig/fonts.conf
  <?xml version="1.0"?>
  <!DOCTYPE fontconfig SYSTEM "urn:fontconfig:fonts.dtd">
  <fontconfig>
    <alias>
      <family>sans-serif</family>
      <prefer>
	<family>Fira Sans</family>
	<family>Liberation Sans</family>
	<family>Noto Sans</family>
      </prefer>
    </alias>
    <alias>
      <family>monospace</family>
      <prefer>
	<family>Fira Code</family>
	<family>Liberation Mono</family>
	<family>Noto Sans Mono</family>
      </prefer>
    </alias>
    <alias>
      <family>serif</family>
      <prefer>
	<family>Liberation Serif</family>
	<family>Noto Serif</family>
      </prefer>
    </alias>
  </fontconfig>
#+end_src

* Sway

** Variables

#+begin_src conf :tangle ~/.config/sway/config
  ### Variables
  #
  # Logo key. Use Mod1 for Alt.
  set $mod Mod4
  # Home row direction keys, like vim
  set $left h
  set $down j
  set $up k
  set $right l
  # Your preferred terminal emulator
  set $term alacritty
  # Your preferred application launcher
  # Note: pass the final command to swaymsg so that the resulting window can be opened
  # on the original workspace that the command was run on.
  set $menu dmenu_path | dmenu | xargs swaymsg exec --
#+end_src

** Output

XWayland applications (e.g. Emacs) do not handle Sway-native scaling
well, see [[https://github.com/swaywm/sway/issues/2966][#2966]] and [[https://github.com/swaywm/wlroots/pull/2064][#2064]]. Emacs supports being built with pure gtk
(~--pgtk~), where, if it's also build with ~--without-x~ it should be
a Wayland native application, avoiding blurry text problems.

However, Gentoo does not have the USE flags for this yet (and it may
not be supported upstream, not sure), so instead I am going to set the
scale to 1 and adjust the font sizes in all my other applications.
[[https://old.reddit.com/r/swaywm/comments/oih4az/help_with_xwayland_scaling_for_hidpi_monitors/][Reddit]] has a nice description of the problem that is current as of
July 2021.

See [[https://gitlab.freedesktop.org/wlroots/wlroots/-/merge_requests/2064][#2064]] on GitLab for any progress on the proposed solution.

#+begin_src conf :tangle ~/.config/sway/config
  ### Output configuration
  #
  # Default wallpaper (more resolutions are available in /usr/share/backgrounds/sway/)
  output * bg /usr/share/backgrounds/sway/Sway_Wallpaper_Blue_1920x1080.png fill
  #
  output eDP-1 resolution 2560x1600 pos 0 0 scale 1
#+end_src

Adjust the font of ~sway-bar~ and window titles to a reasonable size.

#+begin_src conf :tangle ~/.config/sway/config
   font pango:monospace Medium 18
#+end_src

Scale all X applications with this one easy trick! (Wayland developers
/hate/ him!) As an extra bonus, this also scales ~dmenu~.

#+begin_src :conf :tangle ~/.Xresources
  Xft.dpi:   190
#+end_src

And load the application on Sway startup.

#+begin_src conf :tangle ~/.config/sway/config
  exec xrdb -merge ~/.Xresources
#+end_src

While we're at at, let's also scale all Wayland-native QT
applications.

#+begin_src bash :tangle ~/.profile
  export QT_SCALE_FACTOR=2.0
#+end_src

** Idle

#+begin_src conf :tangle ~/.config/sway/config
  ### Idle configuration
  #
  # Example configuration:
  #
  # exec swayidle -w \
  #          timeout 300 'swaylock -f -c 000000' \
  #          timeout 600 'swaymsg "output * dpms off"' resume 'swaymsg "output * dpms on"' \
  #          before-sleep 'swaylock -f -c 000000'
  #
  # This will lock your screen after 300 seconds of inactivity, then turn off
  # your displays after another 300 seconds, and turn your screens back on when
  # resumed. It will also lock your screen before your computer goes to sleep.
#+end_src

** Input

#+begin_src conf :tangle ~/.config/sway/config
  ### Input configuration
  #
  # Example configuration:
  #
  #   input "2:14:SynPS/2_Synaptics_TouchPad" {
  #       dwt enabled
  #       tap enabled
  #       natural_scroll enabled
  #       middle_emulation enabled
  #   }
  #
  input "type:keyboard" {
    xkb_options ctrl:nocaps
  }

  input 2:10:TPPS/2_Elan_TrackPoint {
    # Lower trackpoint sensitivity, -1 <= pointer_accel <= 1
    # Numbers closer to 1 mean a large acceleration, while -1 is vice versa
    pointer_accel -0.5
    # Lower trackpoint scrolling sensitivity, 0 <= scroll_factor < inf
    # https://github.com/swaywm/sway/issues/3004
    # Thanks SpencerMichaels
    scroll_factor 0.3
  }

  input "type:touchpad" {
    pointer_accel 0.4
  }
  # You can get the names of your inputs by running: swaymsg -t get_inputs
  # Read `man 5 sway-input` for more information about this section.
#+end_src

** Key Bindings

*** Basics

#+begin_src conf :tangle ~/.config/sway/config
  ### Key bindings
  #
  # Basics:
  #
  # Start a terminal
  bindsym $mod+Return exec $term

  # Kill focused window
  bindsym $mod+Shift+q kill

  # Start your launcher
  bindsym $mod+d exec $menu

  # Drag floating windows by holding down $mod and left mouse button.
  # Resize them with right mouse button + $mod.
  # Despite the name, also works for non-floating windows.
  # Change normal to inverse to use left mouse button for resizing and right
  # mouse button for dragging.
  floating_modifier $mod normal

  # Reload the configuration file
  bindsym $mod+Shift+c reload

  # Exit sway (logs you out of your Wayland session)
  bindsym $mod+Shift+e exec swaynag -t warning -m 'You pressed the exit shortcut. Do you really want to exit sway? This will end your Wayland session.' -b 'Yes, exit sway' 'swaymsg exit'
#+end_src

*** Navigation

#+begin_src conf :tangle ~/.config/sway/config
  #
  # Moving around:
  #
  # Move your focus around
  bindsym $mod+$left focus left
  bindsym $mod+$down focus down
  bindsym $mod+$up focus up
  bindsym $mod+$right focus right
  # Or use $mod+[up|down|left|right]
  bindsym $mod+Left focus left
  bindsym $mod+Down focus down
  bindsym $mod+Up focus up
  bindsym $mod+Right focus right

  # Move the focused window with the same, but add Shift
  bindsym $mod+Shift+$left move left
  bindsym $mod+Shift+$down move down
  bindsym $mod+Shift+$up move up
  bindsym $mod+Shift+$right move right
  # Ditto, with arrow keys
  bindsym $mod+Shift+Left move left
  bindsym $mod+Shift+Down move down
  bindsym $mod+Shift+Up move up
  bindsym $mod+Shift+Right move right
#+end_src

*** Workspaces

#+begin_src conf :tangle ~/.config/sway/config
  #
  # Workspaces:
  #
  # Switch to workspace
  bindsym $mod+1 workspace number 1
  bindsym $mod+2 workspace number 2
  bindsym $mod+3 workspace number 3
  bindsym $mod+4 workspace number 4
  bindsym $mod+5 workspace number 5
  bindsym $mod+6 workspace number 6
  bindsym $mod+7 workspace number 7
  bindsym $mod+8 workspace number 8
  bindsym $mod+9 workspace number 9
  bindsym $mod+0 workspace number 10
  # Move focused container to workspace
  bindsym $mod+Shift+1 move container to workspace number 1
  bindsym $mod+Shift+2 move container to workspace number 2
  bindsym $mod+Shift+3 move container to workspace number 3
  bindsym $mod+Shift+4 move container to workspace number 4
  bindsym $mod+Shift+5 move container to workspace number 5
  bindsym $mod+Shift+6 move container to workspace number 6
  bindsym $mod+Shift+7 move container to workspace number 7
  bindsym $mod+Shift+8 move container to workspace number 8
  bindsym $mod+Shift+9 move container to workspace number 9
  bindsym $mod+Shift+0 move container to workspace number 10
  # Note: workspaces can have any name you want, not just numbers.
  # We just use 1-10 as the default.
#+end_src

*** Layout

#+begin_src conf :tangle ~/.config/sway/config
  #
  # Layout stuff:
  #
  # You can "split" the current object of your focus with
  # $mod+b or $mod+v, for horizontal and vertical splits
  # respectively.
  bindsym $mod+b splith
  bindsym $mod+v splitv

  # Switch the current container between different layout styles
  bindsym $mod+s layout stacking
  bindsym $mod+w layout tabbed
  bindsym $mod+e layout toggle split

  # Make the current focus fullscreen
  bindsym $mod+f fullscreen

  # Toggle the current focus between tiling and floating mode
  bindsym $mod+Shift+space floating toggle

  # Swap focus between the tiling area and the floating area
  bindsym $mod+space focus mode_toggle

  # Move focus to the parent container
  bindsym $mod+a focus parent
#+end_src

*** Scratchpad

#+begin_src conf :tangle ~/.config/sway/config
  #
  # Scratchpad:
  #
  # Sway has a "scratchpad", which is a bag of holding for windows.
  # You can send windows there and get them back later.

  # Move the currently focused window to the scratchpad
  bindsym $mod+Shift+minus move scratchpad

  # Show the next scratchpad window or hide the focused scratchpad window.
  # If there are multiple scratchpad windows, this command cycles through them.
  bindsym $mod+minus scratchpad show
#+end_src

*** Resizing

#+begin_src conf :tangle ~/.config/sway/config
  #
  # Resizing containers:
  #
  mode "resize" {
  # left will shrink the containers width
  # right will grow the containers width
  # up will shrink the containers height
  # down will grow the containers height
  bindsym $left resize shrink width 10px
  bindsym $down resize grow height 10px
  bindsym $up resize shrink height 10px
  bindsym $right resize grow width 10px

  # Ditto, with arrow keys
  bindsym Left resize shrink width 10px
  bindsym Down resize grow height 10px
  bindsym Up resize shrink height 10px
  bindsym Right resize grow width 10px

  # Return to default mode
  bindsym Return mode "default"
  bindsym Escape mode "default"
  }
  bindsym $mod+r mode "resize"
#+end_src

** Status Bar

#+begin_src conf :tangle ~/.config/sway/config
  #
  # Status Bar:
  #
  # Read `man 5 sway-bar` for more information about this section.
  bar {
      position top

      # When the status_command prints a new line to stdout, swaybar updates.
      # The default just shows the current date and time.
      # status_command while date +'%Y-%m-%d %l:%M:%S %p'; do sleep 1; done

      status_command i3blocks

      colors {
          statusline #ffffff
          background #323232
          inactive_workspace #32323200 #32323200 #5c5c5c
      }
  }
#+end_src

*** i3blocks

#+begin_src conf :tangle ~/.config/i3blocks/config
  # i3blocks configuration file
  #
  # The i3blocks man page describes the usage of the binary,
  # and its website describes the configuration:
  #
  #     https://vivien.github.io/i3blocks
  # Global properties
  separator=true
  separator_block_width=25

  [emerge]
  color=#a5ef19
  # No (xx of yy). Seems TOML messes with regex slightly.
  # I found a solution that worked in the shell but not here.
  # command=qlop -qrM | awk -F'/|[.]|( ETA: )' '{printf "emerging %s %4ds %s\n", $2, $NF, substr($5, index($5, " ")+1, length($5))}'
  command=qlop -qrM | awk -F'[ /.]' '{printf "emerging %s %4ds\n", $4, $NF}'
  interval=1

  # FIXME run on headphones plug-in/remove
  # FIXME literate config signal number as variable
  [volume]
  command=~/bin/volume.sh
  interval=once
  signal=10

  [battery]
  command=~/bin/battery.sh
  interval=10

  [time]
  command=date '+%Y-%m-%d %H:%M:%S'
  interval=1
#+end_src

**** Scripts

***** volume

#+begin_src shell :tangle ~/bin/volume.sh :shebang #!/usr/bin/env bash
  VOL=$(pactl get-sink-volume @DEFAULT_SINK@ | awk '$1=="Volume:" {printf "%4s", $5}')

  # Full and short texts
  echo "Volume: $VOL"
  echo "VOL: $VOL"

  # Set urgent if we can't get volume
  [ -z ${VOL}  ] && exit 33

  exit 0
#+end_src

