config.org
** Debug

#+begin_src yaml
  #debug:
  # Display the time it takes to redraw each frame.
  #render_timer: false

  # Keep the log file after quitting Alacritty.
  #persistent_logging: false

  # Log level
  #
  # Values for `log_level`:
  #   - Off
  #   - Error
  #   - Warn
  #   - Info
  #   - Debug
  #   - Trace
  #log_level: Warn

  # Print all received window events.
  #print_events: false
#+end_src

* IRB

#+begin_src ruby :tangle ~/.config/irb/irbrc
  IRB.conf[:USE_MULTILINE] = false if ENV['INSIDE_EMACS'] && ENV['INSIDE_EMACS'] != 'vterm'
  IRB.conf[:SAVE_HISTORY] ||= 1000
  # I'd love if the next line worked with Ruby, but unfortunately history_dir is out of scope
  # https://bugs.ruby-lang.org/issues/1141 has a comment from Matz about it.
  # Dir.mkdir(history_dir) unless Dir.exist?(history_dir = File.join(ENV['XDG_DATA_HOME'], 'irb'))
  unless Dir.exist?(history_dir = File.join(ENV['XDG_DATA_HOME'], 'irb')) then Dir.mkdir(history_dir) end
  IRB.conf[:HISTORY_FILE] ||= File.join(history_dir, 'irb_history') 
#+end_src

#+begin_src bash :tangle ~/.profile
  if [[ "$XDG_CONFIG_HOME" ]]; then
      export IRBRC="$XDG_CONFIG_HOME"/irb/irbrc
  else
      export IRBRC=~/.config/irb/irbrc
  fi

#+end_src

* Nano

#+begin_src text :tangle ~/.config/nano/nanorc
  # Nano syntax highlighting
  include /usr/share/nano/elisp.nanorc
  include /usr/share/nano/default.nanorc
  include /usr/share/nano/json.nanorc
  include /usr/share/nano/cmake.nanorc
  include /usr/share/nano/java.nanorc
  include /usr/share/nano/sh.nanorc
  include /usr/share/nano/changelog.nanorc
  include /usr/share/nano/groff.nanorc
  include /usr/share/nano/c.nanorc
  include /usr/share/nano/asm.nanorc
  include /usr/share/nano/po.nanorc
  include /usr/share/nano/fortran.nanorc
  include /usr/share/nano/postgresql.nanorc
  include /usr/share/nano/nanohelp.nanorc
  include /usr/share/nano/mgp.nanorc
  include /usr/share/nano/ruby.nanorc
  include /usr/share/nano/pov.nanorc
  include /usr/share/nano/awk.nanorc
  include /usr/share/nano/nftables.nanorc
  include /usr/share/nano/autoconf.nanorc
  include /usr/share/nano/xml.nanorc
  include /usr/share/nano/spec.nanorc
  include /usr/share/nano/ocaml.nanorc
  include /usr/share/nano/objc.nanorc
  include /usr/share/nano/nanorc.nanorc
  include /usr/share/nano/python.nanorc
  include /usr/share/nano/tex.nanorc
  include /usr/share/nano/tcl.nanorc
  include /usr/share/nano/html.nanorc
  include /usr/share/nano/perl.nanorc
  include /usr/share/nano/man.nanorc
  include /usr/share/nano/rust.nanorc
  include /usr/share/nano/lua.nanorc
  include /usr/share/nano/javascript.nanorc
  include /usr/share/nano/makefile.nanorc
  include /usr/share/nano/debian.nanorc
  include /usr/share/nano/php.nanorc
  include /usr/share/nano/guile.nanorc
  include /usr/share/nano/css.nanorc
  include /usr/share/nano/go.nanorc
  include /usr/share/nano/gentoo.nanorc
  include /usr/share/nano/texinfo.nanorc
  include /usr/share/nano/mutt.nanorc
  include /usr/share/nano/patch.nanorc
#+end_src

* Git								      :crypt:

-----BEGIN PGP MESSAGE-----

hQIMA341lovNpziwAQ//T32FISWS+fTf8ceGwGOk2/pr6ir7/sUOFC7eAvDPIhh8
CE4QOSAenchPqkZkJpWpmnGQUFZQwRahj54sfEn/D20dFBOa5YW450fIgxR9vXI3
ZoCTgs+kpEsG2nOVIONjH8vEzpogkBdxE/47CEAm+veU+SHTnoQpITNS9GFMZEdc
cDUxnZwJYH7pkC4iLagE1bzKo4KfYKWZCBXgesrvU81NQzS+QVp26xr0KU+0prat
iSD+Mf6R0ccrsI4A4p1zBTC4kZwLC0cB3fYSDGM6YVppNaRNA/2jAjSMN20+ru/K
IlqGfB7sYUTDoQMGabB9KHJwKBQ+PyExW2VmdzLS0BrUIRTYrXwc0ZjSLCMmwz8H
y3IdOoTt3Ydkm72rxtqAmMKIgSwQxm++xLqDuM4OlREizQrQXmys/KpJFlYlhZI1
EiH39HCh7HAF9vH/wb4+QpO3UYsurizVR2zSkB2DoaxbEDoWwA8fArW+khOJTp4i
Vf/CbOXd1K2nX4jVEEnl/V2Ic+6uwImmN6c7BtZqG58w/VpbsXjG16eKn21R/z3e
2YTs0MKPgaF0hhWO1YtxWjXADMuMJm+583HY1xM2UaSUcW/ifcst3/JV6t5nk4Qo
3Hv0Vlw3giboDvs4+dLT1O/D5D6aJnUdhx3CQcvad7VKdMxTHpSv9dmbF9sd1XzS
wDgBlLQ7/ZBZQActv4DsZFBpkqnG5W/77dSmMfc1SmIpNX2ADk9sq9uLwPjA9ytt
OB8WnAMMc+JAMND7qM1KMXo+UBLS2Ze+0hfTxvBuXqwaRpmnJPqy6WKCpsHc+KZs
MCDRQoLaF5+qCXUYbWUA/qv0r4XjEeidBGQ2xL2yKVrZZPoVAJdY5+7aC7q0+DxJ
n+ys/PeST9bTEtLyNEs4edG10bNDjr3aaF/jZ44atuYv9BKNQ5kCN+nvNFVZuaha
ToW6t5IGkVt4uQTkRW2n12vqjqxShFZxFzAVeV0sEjnbTZNzGCF3H5PUJkkXJupH
wCJnTJV8nVia3w==
=QViv
-----END PGP MESSAGE-----

* Emacs

** Installation

I'll write this up later.

** Configuration
:PROPERTIES:
:header-args: :tangle ~/.emacs.d/init.el
:END:

*** Meta

Much of this section was +stolen+ borrowed from [[https://github.com/larstvei/dot-emacs][larstvei]].

All changes to the configuration should be done in =init.org=, *not* in
=init.el=. Any changes in the =init.el= will be overwritten by saving
=init.org=. The =init.el= in this repo should not be tracked by git, and
is replaced the first time Emacs is started (assuming it has been renamed
to =~/.emacs.d=).

Emacs can't load =.org=-files directly, but =org-mode= provides functions
to extract the code blocks and write them to a file. There are multiple
ways of handling this; like suggested by [[http://emacs.stackexchange.com/questions/3143/can-i-use-org-mode-to-structure-my-emacs-or-other-el-configuration-file][this StackOverflow post]], one
could just use =org-babel-load-file=, but I had problems with
byte-compilation. Previously I tracked both the =org.=- and =el.=-files,
but the git commits got a little messy. So here is a new approach.

When this configuration is loaded for the first time, the =init.el= is
the file that is loaded. It looks like this:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;; init.el --- Initialization
  ;; This file replaces itself with the actual configuration at first run.

  ;; We can't tangle without org!

  ;;; Commentary:
  ;; 

  ;; org-crypt built in since at least 27.2
  (require 'org)
  (require 'org-crypt)
  ;; Open the configuration
  ;;; Code:

  (find-file "~/config.org")
  ;; tangle it
  (org-decrypt-entries)
  (org-babel-tangle)
  (org-encrypt-entries)
  ;; load it
  (load-file "~/config.org")
  ;; finally byte-compile it
  (byte-compile-file (concat user-emacs-directory "init.el"))

  (provide 'init)

  ;;; init.el ends here
#+END_SRC

It tangles the org-file, so that this file is overwritten with the actual
configuration.

There is no reason to track the =init.el= that is generated; by running
the following command =git= will not bother tracking it:

#+BEGIN_SRC sh :tangle no
  git update-index --assume-unchanged init.el
#+END_SRC

If one wishes to make changes to the repo-version of =init.el= start
tracking again with:

#+BEGIN_SRC sh :tangle no
  git update-index --no-assume-unchanged init.el
#+END_SRC

**** Lexical Scoping

I want lexical scoping for the init-file, which can be specified in the
header. The first line of the configuration is as follows:

#+BEGIN_SRC emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+END_SRC

**** Auto-tangle Hook

The =init.el= should (after the first run) mirror the source blocks in
the =init.org=. We can use =C-c C-v t= to run =org-babel-tangle=, which
extracts the code blocks from the current file into a source-specific
file (in this case a =.el=-file).

To avoid doing this each time a change is made we can add a function to
the =after-save-hook= ensuring to always tangle and byte-compile the
=org=-document after changes.

I use =Org Crypt=, which has a feature where it will encrypt your
=org= file when you save. This breaks tangling. I had to modify this
function to tangle everything first, then encrypt before saving.

#+begin_src emacs-lisp
  (defun my/tangle-init ()
    "If the current buffer is 'init.org' the code-blocks are
  tangled, and the tangled file is compiled."
    ;; org-babel-tangle runs save-buffer as a hook. Somewhere along the
    ;; line the current buffer goes back to init.org, leading to an
    ;; infinite loop when using before-save-hook. Now we create a
    ;; tempory buffer with unsaved contents, tangle this buffer, and
    ;; then save, so unencrypted content is tangled and re-encrypted
    ;; before saving.

    (when (equal (buffer-file-name) (expand-file-name "~/config.org"))
      ;; Avoid running hooks when tangling.
      (let ((prog-mode-hook nil) (before-save-hook nil))
	(org-decrypt-entries)
	(org-babel-tangle)
	(org-encrypt-entries))
      (byte-compile-file (concat user-emacs-directory "init.el"))))

  (add-hook
   'org-mode-hook
   (lambda () (add-hook 'before-save-hook 'my/tangle-init nil t)))
#+end_src

*** Basics

**** Bootstraps

***** Guix

Installs =Guix= at the system level. They provide a script to help
with installation across multiple architectures that I download and
run.

~sudo~ is broke and won't consistently read properly from stdin with
-S. See https://serverfault.com/questions/477968. After struggling for
a long time (check the subheading for how far my plight went), I
decided to create a Comint process.

#+begin_src emacs-lisp
  ;; Don't install if already present
  (let ((guix-present (condition-case nil
			  (start-process "guix-test" nil "guix" "--version")
			(error nil))))
    (unless guix-present
      (let ((guix-script
	     (with-current-buffer
		 (url-retrieve-synchronously
		  "https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh"
		  'silent 'inhibit-cookies)
	       ;; Remove HTTP headers
	       ;; https://emacs.stackexchange.com/questions/12464
	       (goto-char (point-min))
	       (re-search-forward "^$")
	       (delete-region (point) (point-min))
	       (buffer-string))))
	;; root permissions required
	;; https://emacs.stackexchange.com/questions/29555
	(let ((name "guix-install")
	      (guix-script-file (make-temp-file "guix-" nil ".sh" guix-script)))
	  (make-comint-in-buffer name nil "sudo" nil "sh" guix-script-file)
	  (display-buffer (process-buffer (get-process name))
			  '(display-buffer-pop-up-window . '(('window-height . 1.0)
							     ('window-width . 0.5)))
							 nil)))))
#+end_src

****** COMMENT Emacs-server + sudo entry

There's a neat trick I found with entering passwords within Emacs, but
it requires using Emacs server. I should modify this to start from
somewhere else.

https://old.reddit.com/r/emacs/comments/kvvrmx/can_sudo_askpass_use_emacs/gj1l989/

=SUDO_ASKPASS=emacsclient -e '(read-passwd "sudo password: ")' | xargs=

#+begin_src emacs-lisp
  (server-start)
#+end_src


***** Straight

I use [[https://github.com/raxod502/straight.el][straight.el]] for package management. This is boostrap code from
the Github repo to set up straight.

#+begin_src emacs-lisp
  (setq straight-repository-branch "develop") ; prebuild support for mu4e
  (defvar straight-fix-flycheck t)
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  (straight-use-package 'use-package)         ; Install use-package
  (setq straight-use-package-by-default t)    ; I don't want to type :straight t a billion times
#+end_src

***** Bind-keys

I'm not entirely sure why this is necessary, and more importantly,
what better solutions there are. But when byte-compiling Emacs,
bind-keys isn't properly loaded by use-package. This means any
custom (and most built-in) keybindings are nonfunctional.

Solution found [[https://old.reddit.com/r/emacs/comments/c6fvvr/unable_to_initialize_package_with_usepackage/es92xjd/][here]].

#+begin_src emacs-lisp
  (use-package bind-key)
#+end_src

**** exec-path-from-shell

I don't want to worry about stuff breaking because of environment
variable weirdness.

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :demand t
    :config
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)))
#+end_src

**** no-littering

#+begin_src emacs-lisp
  (use-package no-littering
    :demand t
    :config
    (setq auto-save-file-name-transforms
	  `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))
#+end_src

**** Speedup

We want to keep the garbage collector from running while we initialize
everything. We can reset it later to a more reasonable value. If we
didn't do this, Emacs would hang when running the garbage collector.

#+begin_src emacs-lisp
  (setq-default
   gc-cons-threshold most-positive-fixnum ; 8 MiB
   gc-cons-percentage 0.6)
#+end_src

Replace the file-name-handler-alist to nil, as regexing is cpu
intensive. We need to keep the original value to restore it later. I
don't know all the details behind it, but it sounds helpful!

#+begin_src emacs-lisp
  (defvar default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
#+end_src

And now we revert the changes with a startup hook. ~16777216~ is the
value Doom uses.

#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (setq gc-cons-threshold 16777216
		    gc-cons-percentage 0.1
		    file-name-handler-alist default-file-name-handler-alist)))
#+end_src

Garbage-collect on focus-out. Emacs /should/ feel snappier overall.
With Emacs 27.1, focus-out-hook is deprecated.

#+BEGIN_SRC emacs-lisp
  (add-function :after after-focus-change-function
		(lambda () (unless (frame-focus-state) (garbage-collect))))
#+END_SRC

Apparently this can result in a significant speedup when using fonts
larger or smaller than the system default.

#+begin_src emacs-lisp
  (setq frame-inhibit-implied-resize t)
#+end_src

***** Results

****** Early Init

As of [2021-02-18 Thu], tangling everything to early-init.el saved 0.06 seconds.

